#pragma once
#include<string>
#include"Npc.h"

struct Square_data
{
	std::string square_str;
	std::string content;
	std::string name;
};

const int MAX_map_x = 20;
const int MAX_map_y = 20;

const int Draw_limit = 10;


class Map 
{
public:
	Map();
	~Map();

	void Init();
	void Main();
	void Draw();
	void Draw(int player_pos_y,int player_pos_x);
	void Destroy();

	std::string GetMap(int y, int x) { return map[y][x]; }
	Square_data GetSquare(int y, int x);
	
	void SetMap(int y, int x, std::string str) { map[y][x] = str; }
private:
	std::string map[MAX_map_y][MAX_map_x] = {	{ "Å°","Å°", "Å°", "Å°", "Å°", "Å°","Å°", "Å°", "Å°", "Å°","Å°","Å°", "Å°", "Å°", "Å°", "Å°","Å°", "Å°", "Å°", "Å°" },
												{ "Å°","Å†", "N", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "N", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "N", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å†","Å†","Å†", "Å†", "Å†", "Å†", "Å†","Å†", "Å†", "Å†", "Å°" },
												{ "Å°","Å°", "Å°", "Å°", "Å°", "Å°","Å°", "Å°", "Å°", "Å°","Å°","Å°", "Å°", "Å°", "Å°", "Å°","Å°", "Å°", "Å°", "Å°" } };
	Npc npcs[3];
};